/* rfc2911 - 4.4.12 printer-state-reasons */
"connecting-to-device" = "Connecting.";
"cover-open" = "Cover open.";
"developer-empty" = "Developer empty.";
"developer-low" = "Developer low.";
"door-open" = "Door open.";
"fuser-over-temp" = "Fuser temperature high.";
"fuser-under-temp" = "Fuser temperature low.";
"input-tray-missing" = "Media tray missing.";
"interlock-open" = "Interlock open.";
"interpreter-resource-unavailable" = "Resource unavailable (i.e. font)";
"marker-supply-empty" = "Ink/toner empty";
"marker-supply-low" = "Ink/toner low.";
"marker-waste-almost-full" = "Ink/toner waste bin almost full.";
"marker-waste-full" = "Ink/toner waste bin full.";
"media-empty" = "Media tray empty.";
"media-jam" = "Media jam.";
"media-low" = "Media tray almost empty.";
"media-needed" = "Media tray needs to be filled.";
"moving-to-paused" = "Printer going offline,";
"none" = " ";
"opc-life-over" = "OPC at end-of-life.";
"opc-near-eol" = "OPC almost at end-of-life.";
"other" = " ";
"output-area-almost-full" = "Output bin almost full.";
"output-area-full" = "Output bin full.";
"output-tray-missing" = "Output tray missing.";
"paused" = "Paused.";
"shutdown" = "Printer offline.";
"spool-area-full" = "Spool area full.";
"stopped-partly" = "Partialy stopped";
"stopping" = "Stopping";
"timed-out" = "Printer stopped responding.";
"toner-empty" = "Out of toner.";
"toner-low" = "Toner low.";

/* rfc2911 - 4.3.8  job-state-reasons */
"aborted-by-system" = "Stopping.";
"compression-error" = "Decompression error.";
"document-access-error" = "Document access error.";
"document-format-error" = "Document format error.";
"job-canceled-at-device" = "Canceled at printer.";
"job-canceled-by-operator" = "Canceled by operator.";
"job-canceled-by-user" = "Canceled by user.";
"job-completed-successfully" = " ";
"job-completed-with-errors" = "Completed with errors.";
"job-completed-with-warnings" = "Completed with warnings.";
"job-data-insufficient" = "Insufficient data.";
"job-hold-until-specified" = "Hold until.";
"job-incoming" = "Incoming.";
"job-interpreting" = "Interpreting.";
"job-outgoing" = "Outgoing.";
"job-printing" = "Printing.";
"job-queued-for-marker" = "Queued for marker.";
"job-queued" = "Queued.";
"job-restartable" = "Restartable.";
"job-transforming" = "Transforming.";
"printer-stopped-partly" = "Printer stopped partly.";
"printer-stopped" = "Printer stopped.";
"processing-to-stop-point" = "Stopping.";
"queued-in-device" = "Ready.";
"resources-are-not-ready" = "Resources are not ready.";
"service-off-line" = "Service off-line.";
"submission-interrupted" = "Submission interrupted.";
"unsupported-compression" = "Unsupported compression.";
"unsupported-document-format" = "Unsupported document format.";

/* rfc3998 - 8/9 Additional Values for {printer,job}-state-reasons */
"hold-new-jobs" = "Hold new jobs";
"deactivated" = "Deactivated";
"job-suspended" = "suspended.";

/* CUPS defined reasons */
"cups-missing-filter-error" = "Missing filter.";
"offline-error" = "Offline.";

/* Apple defined reasons */
"apple-appletalk-disabled-warning" = "AppleTalk is turned off.";
"apple-missing-usbclassdriver-error" = "Missing USB class driver.";
"apple-nbp-lookup-warning" = "Printer not responding.";
